Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The cohort manager / English teacher is responsible for administering and concretizing the framework around the reflection notes, and carrying out the evaluation process.
nb: Kullsjefen/faglærer engelsk er ansvarlig for å administrere og konkretisere rammene rundt refleksjonsnotatene, og gjennomføre evalueringsprosessen.

source: Oral presentation (brief/instruction) with technical, society and defence related – and/or military content
nb: Muntlig fremføring (brief/instruksjon) med teknisk, samfunns-og forsvarsrelatert - og/eller militærfaglig innhold

source: Contribute to ICT-related operational planning and decision-making processes, as well as processes for organizational development, training and exercises, materials, management, teaching and interoperability
nb: Bidra til IKT-relaterte operative plan- og beslutningsprosesser, samt prosesser for utvikling av organisasjon, trening og øving, materiell, ledelse, undervisning og interoperabilitet

source: It provides knowledge about defence planning in Norway in a historical context and presents alternative approaches.
nb: Det gir kunnskap om forsvarsplanlegging i Norge i en historisk sammenheng og presenterer alternative tilnærminger.

source: In general, the course focuses on the individual and collective ability to identify and assess the contextual foundations of military problem solving (professional competence) and the ability to create support and interaction (relational competence).
nb: Generelt er det i emne fokus på individuell og kollektiv evne til å identifisere og vurdere kontekstuelle forutsetninger for militær problemløsning (fagkompetanse) og evne til å skape oppslutning og samhandling (relasjonskompetanse).

source: Management and operation of gas turbine using simulations and laboratory exercises on twin-shaft gas turbine.
nb: Operasjon og drift av gassturbin vha simuleringer og laboratorieøvelser på to-akslet gassturbin.

source: identifying, planning and conducting engineering projects, work tasks, experiments and experimenting both independently and in teams.
nb: identifisere, planlegge og gjennomføre ingeniørfaglige prosjekter, arbeidsoppgaver, forsøk og eksperimenter, både selvstendig og i tverrfaglige team i Sjøforsvaret.

source: knowledge of the history and development of technology with emphasis on electrical, information and communication technology, the role of the cyber engineer in the Armed Forces and in society, management of military Communication and Information Systems (CIS) support and cyber operations, cyber power and consequences of technology development and application
nb: kunnskap om teknologiens historie og utvikling med vekt på elektro-, informasjons- og kommunikasjonsteknologi, cyberingeniørens rolle i Forsvaret og i samfunnet, ledelse av militære Communication and Information Systems (CIS) støtte og cyberoperasjoner, cybermakt og konsekvenser av utvikling og anvendelse av teknologi.

source: Both assessment units must be passed to pass the course.
nb: Begge vurderingsenheter må bestås for å få bestått i emnet.

source: Explain the combat arms’, the unit’s, and your own role and responsibilities.
nb: forklare våpenets, avdelingens, og egen rolle og oppgaver.

source: As part of the course, the cadets will share experiences from own branch (MILM 3404) to give the entire class a basic insight into the practices of the various branches, and which factors are central to exercising effective interaction between the different branches in the Air Force.
nb: Som en del av emnet skal kadettene dele erfaringer fra MILM 3404 Bransjeutdanning for å gi hele kullet en grunnleggende innsikt i de forskjellige bransjers praksis, og hvilke faktorere som er sentrale for å utøve effektiv samhandling mellom bransjer i Luftforsvaret.

source: The fourth part of the course (fourth and half of fifth week) is sought to be completed digitally and focuses on selected parts of the military strategic analysis in NATO.
nb: Emnets fjerde del (fjerde og halve femte uke) søkes gjennomført digitalt og setter fokus på utvalgte deler av den militærstrategiske analysen i NATO.

source: The course will provide the academic basis for the cadets to function as leaders within air force operations, including develop the skills of the cadets to lead and protect themselves and troops in air force operations.
nb: Emnet skal legge det faglige fundamentet for at kadettene skal kunne fungere som ledere i luftmilitære operasjoner, herunder utvikle kadettenes kompetanse til å lede og ivareta seg selv og grupper i luftmilitære operasjoner.

source: As part of the education includes basic courses in electronic warfare, introduction to air traffic service, introduction to operational procedures and regulations, navigation, meteorology, crypto qualification course grade 1, introductory course in intelligence, etc. the education will enable the cadets to support the air squadrons / aircraft departments.
nb: Som en del av utdanningen inngår blant annet grunnkurs i elektronisk krigføring, innføring i lufttrafikktjeneste, innføring i operative prosedyrer og bestemmelser, navigasjon, meteorologi, kryptokvalifiseringskurs grad 1, introduksjonskurs i etterretning osv.

source: The candidate has knowledge of software development, as well as principles for structure and architecture for computer systems and networks.
nb: Kandidaten har kunnskap om programvareutvikling, samt prinsipper for oppbygning og arkitektur for datasystemer og nettverk.

source: Account for the country’s total defence concept, including readiness system and plans.
nb: Gjøre rede for nasjonens totalforsvarskonsept, herunder beredskapssystem og planverk.

source: This includes, among other things, training in the management and operation of the command area/operational rooms and operational decision-making.
nb: Dette innebærer blant annet trening på ledelse og drift av kommandoplass/operasjonsrom og operativ beslutningstaking.

source: Management of personnel in emergency situations.
nb: Planlegging og planverk for krisehåndtering

source: The final thesis topic and statement is submitted for approval by the end of teaching week 3.
nb: Endelig emne og problemstilling leveres for godkjenning innen utløpet av undervisningsuke 3.

source: From Vessel Conveyance with Navigation Control, Norvald Kjerstad
nb: Fra Fremføring av skip med navigasjonskontroll, Norvald Kjerstad

source: Explain the basic principles and methods of designing and constructing roads and bridges.
nb: Forklare de grunnleggende prinsippene og metodene for dimensjonering og forsterking av veger og bruer.

source: The Norwegian Pilot, Volume 1
nb: Den norske los bind 1

source: understand self-management and its responsibilities in the leadership role under challenging conditions.
nb: forstå selvledelse og sitt ansvar i lederrollen under krevende forhold.

source: The course builds on and assumes previously completed and passed examination in common course with law in semester 1.
nb: Emnet bygger videre på og forutsetter gjennomført og bestått eksamen i fellesemne med rettslære fra semester 1.

source: Scope, number and form vary from course to course.
nb: Omfang, antall og form varierer mellom emnene.

source: Lectures, self-studies, group assignments and compulsory exercises.
nb: Forelesninger, selvstudium, gruppeoppgaver og obligatoriske øvinger.

source: The topic trains the cadets in mastering winter conditions.
nb: Temaet trener kadettene i å mestre vinterforhold.

source: an understanding of how to assess weather forecasts for planning and conducting passages
nb: forståelse til å vurdere værprognoser ifm seilasplanlegging og gjennomføres av seilas

source: Working and learning activities
nb: Organisering og koordinering

source: In connection with this topic, a study trip is carried out to the Armed Forces' operational headquarters (FOH) and the National Air Operations Center (NAOC).
nb: I forbindelse med dette tema gjennomføres en studietur til Forsvarets operative hovedkvarter (FOH) og nasjonalt luftoperasjonssenter (NLUS/NAOC).

source: Navigators are trained by the US Navy Education Department.
nb: Navigatører utdannes ved utdanningsavdeling i US Navy.

source: Satellite-based systems (Kjerstad, Part 1, Chapter 3)
nb: Satellittbaserte systemer (Kjerstad, Del 1, Kapittel 3)

source: Expected learning outcome for Bachelor in military studies with specialisation in management – Naval Engineer Machine
nb: Forventet læringsutbytte for Bachelor i militære studier med fordypning i ledelse - sjømakt og militær navigasjon:

source: explain the difference between qualitative and quantitative methods and their strengths and limitations
nb: forklare forskjellen på kvalitative og kvantitative metoder og deres styrker og begrensninger

source: The topic ranges from high to low intensity, and from defensive to offensive operations.
nb: Tematikken spenner fra høy- til lavintensitet og fra defensive til offensive operasjoner.

source: • adapt cable systems and antennas to the transmission system
nb: • tilpasse kabelsystemer og antenner til overføringssystemet

source: The course will build on the teaching of the previous course of Policy, Strategy and Military Force, as well as the basic understanding of joint operations communicated through the Master programme’s course Joint Operations 1.
nb: Emnet vil bygge på undervisningen i det foregående emnet Politikk, Strategi og Militærmakt, samt den grunnleggende forståelsen av og rundt fellesoperasjoner som er formidlet gjennom Masterutdanningens emne Fellesoperasjoner 1.

source: Off- design operation of diesel engines, external and internal factors’ impact on the performance diagram, use of simulator laboratory exercise.
nb: Off- design drift av dieselmotorer, ytre og indre faktorers betydning på ytelsesdiagrammet., bruk av simulator og laboratorieøvelse.

source: The exercise has the following objectives:
nb: Øvelsen har følgende mål:

source: Focus is on the entirety for logistics, and how work is done for good readiness with varying readiness times.
nb: Det fokuseres på helheten for logistikk, og hvordan det arbeides for god beredskap med varierende klartider.

source: The course's second topic (1 week) will address military warfare levels and the military command structure, both nationally and within NATO.
nb: Emnets andre tema (1 uke) vil ta for seg militære krigføringsnivåer og den militære kommandostrukturen, både nasjonal og i NATO.

source: Laboratory work where records are kept for approval for 2-3 laboratory exercises.
nb: Laboratoriearbeid hvor det føres journal til godkjenning for 2-3 laboratorieoppgaver.

source: NATO and the national command centre, including the structure of HQ.
nb: kunnskap om det ordreverk, både nasjonalt og i NATO, som Sjøforsvarets offiserer må forholde seg til

source: dimension welds and bolted joints for yield and fatigue.
nb: dimensjonere sveise- og skrueforbindelser for flyting og utmatting.

source: TEWT Bagn is an arena where you gain an insight into the realities of the officer profession and help to create a professional identity.
nb: TØUT Bagn er en arena der man får innblikk i offisersyrkes realiteter og er med på å skape profesjonsidentitet.

source: perform readings, analyse collected data and calculate thermal and mechanical conditions for turbo engines.
nb: gjennomføre målinger, analysere innsamlede data og beregne termiske og mekaniske forhold for turbomaskiner.

source: use relevant geographical analysis methods to assess and answer relevant information needs
nb: benytte aktuelle geografiske analysemetoder for å vurdere og besvare relevante informasjonsbehov

source: • describe the Norwegian Armed Forces’ tasks and organisation, including also on force production for the cyber engineer's field
nb: • beskrive Forsvarets oppgaver og organisering, herunder også om styrkeproduksjon til cyberingeniørens fagfelt

source: Officer Development is included in all courses for the NDUC BA in Military Studies where specialisation in Leadership and Land Power applies.
nb: Offisersutvikling er en del av alle emner i BA i militære studier med fordypning i ledelse og landmakt.

source: Military sports and training (MIT) are taught in parallel with the course.
nb: Militær idrett og trening (MIT) undervises parallelt med emnet.

source: The course is based on the ING1501 The Cyber Engineer’s Profession, ING1506 Data Communication, ING2506 Telecommunications, and ING2503 Information Security.
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon, ING1506 Datakommunikasjon, ING2506 Telekommunikasjon, og ING2503 Informasjonssikkerhet

source: Organisation and coordination
nb: Organisering og koordinering

source: relate relevant issues while navigating in optical control mode.
nb: relevante problemstillinger under seilas i optisk kontrollmode.

source: Visibility is 100 m, and the cadet must learn to sail in all the different radar presentation modes (Relative, True, North Up, Course Up and Head Up).
nb: Sikten er 100 m, og kadetten må lære å seile i alle de ulike radar presentasjons modene (Relativ, True, North Up, Course Up og Head Up).

source: apply relevant methodology tools and plan, identify solutions and document these in a clear and orderly manner
nb: anvende relevant metodeverktøy og planlegge, finne løsninger og dokumentere de på en klar og ryddig måte

source: Common to most courses are lectures, group work, compulsory papers and practice.
nb: Felles for de fleste emner er forelesninger, gruppearbeid, obligatoriske innleveringer og praksis.

source: Principles for efficient logistics, particularly in a military context.
nb: Prinsipper for effektiv logistikk, i en militær kontekst spesielt.

source: Lectures in class, videolectures, group work with oral presentations of results in class or by video/online, required task, panel debates/seminars, self-study, written assignment.
nb: Forelesninger i plenum, videoforelesninger, gruppearbeid med muntlig presentasjon av resultater i plenum eller gjennom videooverføring, arbeidskrav, paneldebatt/seminar, selvstudium, skriftlig oppgave.

source: • maintain combat capability and use command and control information systems under field conditions
nb: • opprettholde stridsevne og anvende kommando og kontroll informasjonssystemer under feltforhold

source: Use of film/video
nb: Bruk av film / video

source: to provide the cadets with experiences of holistic debriefing in order to ensure learning in the aftermath of military missions.
nb: gi kadettene erfaringer med helhetlig debriefing for å sikre læring i etterkant av militære oppdrag.

source: • demonstrate detailed knowledge of the layer model and the protocols used for communication over the Internet
nb: • vise detaljert kunnskap om lagmodellen og protokollene som benyttes for kommunikasjon over Internett

source: The course deals with various GIS analyzes (raster, vector, network and statistical analysis).
nb: Emnet tar for seg ulike GIS-analyser (raster-, vektor-, nettverks- og statistiske analyser).

source: Introduction to how ethics, politics and international law (
nb: Innføring i hvordan etikk, politikk og folkerett (

source: The cyber engineer’s role, responsibility and profession
nb: Cyberingeniørens rolle, ansvar og profesjon

source: • explain the concept series, including Power and Fourier series
nb: • forklare begrepet rekker, herunder Potens- og Fourierrekker

source: • explain the signal structure for central modulated signals
nb: • forklare signaloppbygning for sentrale modulerte signal

source: • Statistical methodology, including confidence interval and testing hypotheses
nb: • Statistisk metodelære, inkludert konfidensintervall og hypotesetesting

source: The topics in the course are: Research ethics, selected issues in academic theory, key concepts in scientific methods, the writing process and its issues, qualitative methods, quantitative methods
nb: Forskningsetikk, utvalgte vitenskapsteoretiske problemstillinger, sentrale begreper i vitenskapelig metode, skriveprosessen og problemstillinger, kvalitative metoder, kvantitative metoder

source: Øi: Trigonometry and navigation formulas
nb: kjennskap til prosedyrer ved nødstyring og nødslep

source: The voyage is divided into 4 phases
nb: Oppdelingen av seilasen i 4 faser

source: Lectures, compulsory laboratory assignments(for those without chemistry from high school) and assignment solving.
nb: Forelesninger, obligatorisk laboratorieoppgave(for de som ikke har kjemi fra VGS) og oppgaveløsning.

source: use tidal tables for the Norwegian coast and Svalbard
nb: bruke tidevannstabeller for norskekysten og Svalbard

source: The purpose of the course is to cover the Navy's requirements, and satisfy the requirements of STCW 1978 with amendments within navigation systems in the function navigation at the management level.
nb: Hensikten med emnet er å dekke Sjøforsvarets behov, samt tilfredsstille kravene i STCW, 1978, med tillegg innen navigasjonssystemer i funksjonen navigering på ledelsesnivå.

source: Learning activities will be a combination of teaching (physical or online), self-study and practice work.
nb: Arbeidsform vil være en kombinasjon av undervisning (fysisk eller online), selvstudium og praksis arbeid.

source: Systems for control and regulation of air/fuel supply to diesel engines and boiler systems, with simulator exercise.
nb: Systemer for kontroll og regulering av luft/brennstofftilførsel til dieselmotorer og kjeleanlegg, med simulatorøvelse.

source: • master the use of measuring instruments for antennas and transmission lines
nb: • beherske bruk av måleinstrumenter for antenner og transmisjonslinjer

source: Phase diagrams, transitions and thermal processes.
nb: Fasediagrammer, overganger og termiske prosesser.

source: be able to inspect and report faults and damage to cargo spaces, hatch covers and ballast tanks, assess these and take appropriate measures
nb: kunne inspisere og rapportere feil og skader på lasterom, lukedeksler og ballasttanker, vurdere disse og treffe passende tiltak

source: Transverse and longitudinal stability.
nb: Tverr- og langskips stabilitet.

source: This is totally 864 pages.
nb: Dette utgjør totalt 864 sider.

source: The semester 5 weekend voyage comes towards the end of the semester, where the aim is to reinforce the training objectives within optical navigation day and night to prepare the cadet for the exam.
nb: Helgeseilasen semester 5 kommer mot slutten av semesteret hvor hensikten er å befeste øvingsmålene innen optisk navigasjon dag og natt som forberedelse av kadetten mot eksamen.

source: The course’s final topic focuses on national crisis management within the conflict spectrum from peace via crisis to war, including Norway's relationship with allies.
nb: Emnets avsluttende tema setter fokus på nasjonal krisehåndtering i konfliktspekteret fra fred, via krise til krig, og herunder Norges forhold til allierte.

source: The course provides broad knowledge of navigation systems, ship and auxiliary machinery as well as hull systems.
nb: Emnet gir bred kunnskap om navigasjonsystemer, skips-, hjelpemaskineri og skrogsystemer.

source: knowledge of how GPS and dGPS function
nb: kjennskap til virkemåten for GPS og dGPS

source: • explain the rationale for the military planning and decision-making process
nb: forklare rasjonalet for militær plan- og beslutningsprosess

source: Educational and organisational changes in crises.
nb: Luftforsvaret som en lærende organisasjon

source: The course aims to provide the students with an insight and specialisation within the most key military theories and doctrines that have guided the development of military operations on the ground since 1970.
nb: Emnet tar sikte på å gi elevene innsikt og fordypning i de mest sentrale militære teoriene og doktrinene som har styrt utviklingen av landmilitære operasjoner siden 1970.

source: (GLF-O), where the purpose is to put the cadet in a position to lead a command, make simple assessments and decisions, give orders and take action based on individual situational awareness within a military context.
nb: (GLF-O), der formålet er å sette kadetten i stand til å føre kommando foreta enkle vurderinger og beslutninger, gi ordrer og iverksette tiltak basert på egen situasjonsforståelse i en militær kontekst.

source: The semester 6 weekend voyage comes in the last half of the semester and is the last exercise in MPN.
nb: Helgeseilasen semseter 6 kommer i siste halvdel av semesteret og er den siste øvelsen i MPN.

source: - More use of digital learning methods.
nb: Mer bruk av digitale læringsformer.

source: explain damage, faults and maintenance issues related to the subject.
nb: forklare skader, feil og vedlikeholdsproblematikk knyttet til emnet.

source: Knowledge of Military Geomatics (MilGeo) and Geographic Information Systems (GIS) is an advantage.
nb: Kjennskap til militær geomatikk (MilGeo) og geografiske informasjonssystemer (GIS) er en fordel.

source: Lectures (online lectures in statistics), exercises and statistics project with Python.
nb: Forelesninger (undervisning i statistikk vil foregå online), øvinger og statistikkprosjekt med Python.

source: relate relevant professional and work ethic issues involving the vessel type
nb: relevante fag- og yrkesetiske problemstillinger innen fartøystypen

source: All traditional lectures, as well as scheduled tutorials in plenary, will be streamed and recorded.
nb: Alle tradisjonelle forelesninger, samt oppsatte veiledningstimer i plenum, vil bli strømmet og gjort opptak av.

source: The course is completed with a combination of student-active and problem-solving activities, study trips and courses.
nb: Emnet gjennomføres med en kombinasjonen av studentaktive og problemløsende aktiviteter, studietur og kurs.

source: In addition, the course will deal with fundamental issues related to the planning and implementation of joint operations within a multinational NATO context.
nb: I tillegg vil emnet behandle grunnleggende problemstillinger knyttet til planlegging og gjennomføring av fellesoperasjoner i en multinasjonal NATO-kontekst.

source: The course provides a basis for conducting and leading maintenance work at sea and at quay.
nb: Emnet bidrar til et grunnlag for å utføre og lede vedlikeholdsarbeider i sjøen og ved landligge.

source: work in relevant physical and digital laboratories and workshops and master methods and tools as a basis for goal-oriented and innovative work.
nb: arbeide i relevante fysiske og digitale laboratorier og verksteder og beherske metoder og verktøy som grunnlag for målrettet og innovativt arbeid.

source: This is followed by 2 weeks where the students man relevant work positions in the operational headquarters and carry out selected parts of a joint operation.
nb: Deretter følger 2 uker hvor studentene bemanner relevante arbeidsposisjoner i det operasjonelle hovedkvarteret og gjennomfører utvalgte deler av en fellesoperasjon.

source: The purpose of Blindleia is to practice using ECDIS and the assistant's role in the bridge team.
nb: Hensikten med Blindleia er å praktisere bruken av ECDIS og assistentens rolle i broteamet.

source: Apply professional knowledge of crises and education and what actions must be taken to safeguard and develop the organisation during and after crises/events/change.
nb: anvende faglig kunnskap om kriser og læring og hvilke tiltak som må iverksettes for å ivareta og utvikle organisasjonen under og etter kriser/hendelser/endring.

source: A bonus percentage of up to 5% is given depending on the number of tasks the student has registered as completed in the course.
nb: Det gis opptil 5% bonusprosent avhengig av antall oppgaver studenten har registrert som gjennomført i emnet.
